{
  "architectures": [
    "BERT_BiLSTM_CRF"
  ],
  "attention_probs_dropout_prob": 0.1,
  "directionality": "bidi",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "I-EVENT",
    "1": "I-LAW",
    "2": "I-NORP",
    "3": "I-QUANTITY",
    "4": "I-CONCEPT",
    "5": "I-J",
    "6": "B-QUANTITY",
    "7": "I-TITLE",
    "8": "B-EVENT",
    "9": "B-TIME",
    "10": "B-FAC",
    "11": "I-SLOGAN",
    "12": "B-TITLE",
    "13": "I-FAC",
    "14": "I-IDIOM",
    "15": "B-PERSON",
    "16": "B-TERM",
    "17": "I-TERM",
    "18": "I-LOC",
    "19": "I-POLICY",
    "20": "I-PRODUCT",
    "21": "I-ORG",
    "22": "B-J",
    "23": "B-ENGLISH",
    "24": "O",
    "25": "B-FIN",
    "26": "B-PRODUCT",
    "27": "I-WORK_OF_ART",
    "28": "B-POLICY",
    "29": "I-TIME",
    "30": "B-UNIT",
    "31": "B-LANGUAGE",
    "32": "I-LANGUAGE",
    "33": "B-WORK_OF_ART",
    "34": "I-FIN",
    "35": "B-LOC",
    "36": "B-IDIOM",
    "37": "B-ORG",
    "38": "I-PERSON",
    "39": "B-LAW",
    "40": "I-ENGLISH",
    "41": "B-SLOGAN",
    "42": "B-NORP",
    "43": "B-CONCEPT",
    "44": "I-UNIT"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-CONCEPT": 43,
    "B-ENGLISH": 23,
    "B-EVENT": 8,
    "B-FAC": 10,
    "B-FIN": 25,
    "B-IDIOM": 36,
    "B-J": 22,
    "B-LANGUAGE": 31,
    "B-LAW": 39,
    "B-LOC": 35,
    "B-NORP": 42,
    "B-ORG": 37,
    "B-PERSON": 15,
    "B-POLICY": 28,
    "B-PRODUCT": 26,
    "B-QUANTITY": 6,
    "B-SLOGAN": 41,
    "B-TERM": 16,
    "B-TIME": 9,
    "B-TITLE": 12,
    "B-UNIT": 30,
    "B-WORK_OF_ART": 33,
    "I-CONCEPT": 4,
    "I-ENGLISH": 40,
    "I-EVENT": 0,
    "I-FAC": 13,
    "I-FIN": 34,
    "I-IDIOM": 14,
    "I-J": 5,
    "I-LANGUAGE": 32,
    "I-LAW": 1,
    "I-LOC": 18,
    "I-NORP": 2,
    "I-ORG": 21,
    "I-PERSON": 38,
    "I-POLICY": 19,
    "I-PRODUCT": 20,
    "I-QUANTITY": 3,
    "I-SLOGAN": 11,
    "I-TERM": 17,
    "I-TIME": 29,
    "I-TITLE": 7,
    "I-UNIT": 44,
    "I-WORK_OF_ART": 27,
    "O": 24
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "type_vocab_size": 2,
  "vocab_size": 119547
}
