{"do_lower_case": false, "model_max_length": 512, "use_fast": false, "special_tokens_map_file": "/content/gdrive/My Drive/ETNET/NER/news/code/PeijiYang/pretrain_models/bert-base-multilingual-cased/special_tokens_map.json", "full_tokenizer_file": null}